{
  "architectures":  "LlamaForCausalLM",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "initializer_range": 0.02,
  "hidden_act": "silu",
  "hidden_size": 1920,
  "intermediate_size": 6720,
  "num_attention_heads": 12,
  "num_key_value_heads": 6,
  "num_hidden_layers": 15,
  "max_position_embeddings": 8192,
  "max_len":1024,
  "mlp_bias": false,
  "model_type": "llama",
  "attn_implementation": "sdpa",
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null, 
  "rope_theta": 500000.0,
  "rope_theta_onset":199999, 
  "rope_theta_dur":1031,
  "rope_theta_octave":19,
  "rope_theta_pitch":20,
  "rope_theta_velocity":131,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.41.0.dev0",
  "use_cache": false,
  "sos_token":-1,
  "eos_token":-2,
  "pad_token":-3,
  "soc_token":-4,
  "eoc_token":-5,
  "metadata_tokens":[-4, -5, -6, -7, -8, -9, -10, -11, -12, -13, -14, -15, -16, -17, -18, -19, -20, -21, -22, -23, -24, -25, -26, -27, -28, -29, -30, -31, -32, -33, -34, -35, -36, -37, -38, -39, -40, -41, -42, -43, -44, -45, -46, -47, -48, -49, -50, -51, -52, -53, -54, -55, -56, -57, -58, -59, -60, -61, -62, -63, -64, -65, -66, -67, -68, -69, -70, -71, -72, -73, -74, -75, -76, -77, -78, -79, -80, -81, -82, -83, -84, -85, -86, -87, -88, -89, -90, -91, -92, -93, -94, -95, -96, -97, -98, -99, -100, -101, -102, -103, -104, -105, -106, -107, -108, -109, -110, -111, -112, -113, -114, -115, -116, -117, -118, -119, -120, -121, -122, -123, -124, -125, -126, -127, -128, -129, -130, -131, -132, -133, -134, -135, -136, -137, -138, -139, -140, -141, -142, -143, -144, -145, -146, -147, -148, -149, -150, -151, -152, -153, -154, -155, -156, -157, -158, -159, -160, -161, -162, -163, -164, -165, -166, -167, -168, -169, -170, -171, -172, -173, -174, -175, -176, -177, -178, -179, -180, -181, -182, -183, -184, -185, -186, -187, -188, -189, -190, -191, -192, -193, -194, -195, -196, -197, -198, -199, -200, -201, -202, -203, -204, -205, -206, -207, -208, -209, -210, -211, -212, -213, -214, -215, -216, -217, -218, -219, -220, -221, -222, -223, -224, -225, -226, -227, -228, -229, -230, -231, -232, -233, -234, -235, -236, -237, -238, -239, -240, -241, -242, -243, -244, -245, -246, -247, -248, -249, -250, -251, -252, -253, -254, -255, -256, -257, -258, -259, -260, -261, -262, -263, -264, -265, -266, -267, -268, -269, -270, -271, -272, -273, -274, -275, -276, -277, -278, -279, -280, -281, -282, -283, -284, -285, -286, -287, -288, -289, -290, -291, -292, -293, -294, -295, -296, -297, -298, -299, -300, -301, -302, -303, -304, -305, -306, -307, -308, -309, -310, -311, -312, -313, -314, -315, -316, -317, -318, -319, -320, -321, -322, -323, -324, -325, -326, -327, -328, -329, -330, -331, -332, -333],
  "metadata_tokens_pos":{"-8": [0, 0, 6, 5, 0, 0], "-9": [0, 0, 2, 5, 0, 0], "-10": [0, 0, 4, 5, 0, 0], "-11": [0, 0, 5, 5, 0, 0], "-12": [0, 0, 3, 5, 0, 0], "-13": [0, 0, 7, 11, 0, 0], "-14": [0, 0, 1, 5, 0, 0], "-94": [0, 0, 0, 0, 0, 2], "-95": [0, 0, 0, 0, 0, 3], "-96": [0, 0, 0, 0, 0, 4], "-97": [0, 0, 0, 0, 0, 5], "-98": [0, 0, 0, 0, 0, 6], "-99": [0, 0, 0, 0, 0, 7], "-100": [0, 0, 0, 0, 0, 9], "-101": [0, 0, 0, 0, 0, 10], "-102": [0, 0, 0, 0, 0, 11], "-103": [0, 0, 0, 0, 0, 12], "-104": [0, 0, 0, 0, 0, 13], "-105": [0, 0, 0, 0, 0, 14], "-106": [0, 0, 0, 0, 0, 15], "-107": [0, 0, 0, 0, 0, 16], "-108": [0, 0, 0, 0, 0, 17], "-109": [0, 0, 0, 0, 0, 18], "-110": [0, 0, 0, 0, 0, 19], "-111": [0, 0, 0, 0, 0, 20], "-112": [0, 0, 0, 0, 0, 21], "-113": [0, 0, 0, 0, 0, 22], "-114": [0, 0, 0, 0, 0, 23], "-115": [0, 0, 0, 0, 0, 24], "-116": [0, 0, 0, 0, 0, 25], "-117": [0, 0, 0, 0, 0, 26], "-118": [0, 0, 0, 0, 0, 27], "-119": [0, 0, 0, 0, 0, 28], "-120": [0, 0, 0, 0, 0, 29], "-121": [0, 0, 0, 0, 0, 30], "-122": [0, 0, 0, 0, 0, 31], "-123": [0, 0, 0, 0, 0, 32], "-124": [0, 0, 0, 0, 0, 33], "-125": [0, 0, 0, 0, 0, 34], "-126": [0, 0, 0, 0, 0, 35], "-127": [0, 0, 0, 0, 0, 36], "-128": [0, 0, 0, 0, 0, 37], "-129": [0, 0, 0, 0, 0, 38], "-130": [0, 0, 0, 0, 0, 39], "-131": [0, 0, 0, 0, 0, 40], "-132": [0, 0, 0, 0, 0, 41], "-133": [0, 0, 0, 0, 0, 42], "-134": [0, 0, 0, 0, 0, 43], "-135": [0, 0, 0, 0, 0, 44], "-136": [0, 0, 0, 0, 0, 45], "-137": [0, 0, 0, 0, 0, 46], "-138": [0, 0, 0, 0, 0, 47], "-139": [0, 0, 0, 0, 0, 48], "-140": [0, 0, 0, 0, 0, 49], "-141": [0, 0, 0, 0, 0, 50], "-142": [0, 0, 0, 0, 0, 51], "-143": [0, 0, 0, 0, 0, 52], "-144": [0, 0, 0, 0, 0, 53], "-145": [0, 0, 0, 0, 0, 54], "-146": [0, 0, 0, 0, 0, 55], "-147": [0, 0, 0, 0, 0, 56], "-148": [0, 0, 0, 0, 0, 57], "-149": [0, 0, 0, 0, 0, 58], "-150": [0, 0, 0, 0, 0, 59], "-151": [0, 0, 0, 0, 0, 60], "-152": [0, 0, 0, 0, 0, 61], "-153": [0, 0, 0, 0, 0, 62], "-154": [0, 0, 0, 0, 0, 63], "-155": [0, 0, 0, 0, 0, 64], "-156": [0, 0, 0, 0, 0, 65], "-157": [0, 0, 0, 0, 0, 66], "-158": [0, 0, 0, 0, 0, 67], "-159": [0, 0, 0, 0, 0, 68], "-160": [0, 0, 0, 0, 0, 69], "-161": [0, 0, 0, 0, 0, 70], "-162": [0, 0, 0, 0, 0, 71], "-163": [0, 0, 0, 0, 0, 72], "-164": [0, 0, 0, 0, 0, 73], "-165": [0, 0, 0, 0, 0, 74], "-166": [0, 0, 0, 0, 0, 75], "-167": [0, 0, 0, 0, 0, 76], "-168": [0, 0, 0, 0, 0, 77], "-169": [0, 0, 0, 0, 0, 78], "-170": [0, 0, 0, 0, 0, 79], "-171": [0, 0, 0, 0, 0, 80], "-172": [0, 0, 0, 0, 0, 81], "-173": [0, 0, 0, 0, 0, 82], "-174": [0, 0, 0, 0, 0, 83], "-175": [0, 0, 0, 0, 0, 84], "-176": [0, 0, 0, 0, 0, 85], "-177": [0, 0, 0, 0, 0, 86], "-178": [0, 0, 0, 0, 0, 87], "-179": [0, 0, 0, 0, 0, 88], "-180": [0, 0, 0, 0, 0, 89], "-181": [0, 0, 0, 0, 0, 90], "-182": [0, 0, 0, 0, 0, 91], "-183": [0, 0, 0, 0, 0, 92], "-184": [0, 0, 0, 0, 0, 93], "-185": [0, 0, 0, 0, 0, 94], "-186": [0, 0, 0, 0, 0, 95], "-187": [0, 0, 0, 0, 0, 96], "-188": [0, 0, 0, 0, 0, 97], "-189": [0, 0, 0, 0, 0, 98], "-190": [0, 0, 0, 0, 0, 99], "-191": [0, 0, 0, 0, 0, 100], "-192": [0, 0, 0, 0, 0, 101], "-193": [0, 0, 0, 0, 0, 102], "-194": [0, 0, 0, 0, 0, 103], "-195": [0, 0, 0, 0, 0, 104], "-196": [0, 0, 0, 0, 0, 105], "-197": [0, 0, 0, 0, 0, 106], "-198": [0, 0, 0, 0, 0, 107], "-199": [0, 0, 0, 0, 0, 108], "-200": [0, 0, 0, 0, 0, 109], "-201": [0, 0, 0, 0, 0, 110], "-202": [0, 0, 0, 0, 0, 111], "-203": [0, 0, 0, 0, 0, 112], "-204": [0, 0, 0, 0, 0, 113], "-205": [0, 0, 0, 0, 0, 114], "-206": [0, 0, 0, 0, 0, 115], "-207": [0, 0, 0, 0, 0, 116], "-208": [0, 0, 0, 0, 0, 117], "-209": [0, 0, 0, 0, 0, 118], "-210": [0, 0, 0, 0, 0, 119], "-211": [0, 0, 0, 0, 0, 120], "-212": [0, 0, 0, 0, 0, 121], "-213": [0, 0, 0, 0, 0, 122], "-214": [0, 0, 0, 0, 0, 123], "-215": [0, 0, 0, 0, 0, 124], "-216": [0, 0, 0, 0, 0, 125], "-217": [0, 0, 0, 0, 0, 127], "-218": [0, 0, 0, 0, 0, 2], "-219": [0, 0, 0, 0, 0, 4], "-220": [0, 0, 0, 0, 0, 12], "-221": [0, 0, 0, 0, 0, 14], "-222": [0, 0, 0, 0, 0, 16], "-223": [0, 0, 0, 0, 0, 17], "-224": [0, 0, 0, 0, 0, 18], "-225": [0, 0, 0, 0, 0, 19], "-226": [0, 0, 0, 0, 0, 20], "-227": [0, 0, 0, 0, 0, 21], "-228": [0, 0, 0, 0, 0, 22], "-229": [0, 0, 0, 0, 0, 23], "-230": [0, 0, 0, 0, 0, 24], "-231": [0, 0, 0, 0, 0, 25], "-232": [0, 0, 0, 0, 0, 26], "-233": [0, 0, 0, 0, 0, 27], "-234": [0, 0, 0, 0, 0, 28], "-235": [0, 0, 0, 0, 0, 29], "-236": [0, 0, 0, 0, 0, 30], "-237": [0, 0, 0, 0, 0, 31], "-238": [0, 0, 0, 0, 0, 32], "-239": [0, 0, 0, 0, 0, 33], "-240": [0, 0, 0, 0, 0, 34], "-241": [0, 0, 0, 0, 0, 35], "-242": [0, 0, 0, 0, 0, 36], "-243": [0, 0, 0, 0, 0, 37], "-244": [0, 0, 0, 0, 0, 38], "-245": [0, 0, 0, 0, 0, 39], "-246": [0, 0, 0, 0, 0, 40], "-247": [0, 0, 0, 0, 0, 41], "-248": [0, 0, 0, 0, 0, 42], "-249": [0, 0, 0, 0, 0, 43], "-250": [0, 0, 0, 0, 0, 44], "-251": [0, 0, 0, 0, 0, 45], "-252": [0, 0, 0, 0, 0, 46], "-253": [0, 0, 0, 0, 0, 47], "-254": [0, 0, 0, 0, 0, 48], "-255": [0, 0, 0, 0, 0, 49], "-256": [0, 0, 0, 0, 0, 50], "-257": [0, 0, 0, 0, 0, 51], "-258": [0, 0, 0, 0, 0, 52], "-259": [0, 0, 0, 0, 0, 53], "-260": [0, 0, 0, 0, 0, 54], "-261": [0, 0, 0, 0, 0, 55], "-262": [0, 0, 0, 0, 0, 56], "-263": [0, 0, 0, 0, 0, 57], "-264": [0, 0, 0, 0, 0, 58], "-265": [0, 0, 0, 0, 0, 59], "-266": [0, 0, 0, 0, 0, 60], "-267": [0, 0, 0, 0, 0, 61], "-268": [0, 0, 0, 0, 0, 62], "-269": [0, 0, 0, 0, 0, 63], "-270": [0, 0, 0, 0, 0, 64], "-271": [0, 0, 0, 0, 0, 65], "-272": [0, 0, 0, 0, 0, 66], "-273": [0, 0, 0, 0, 0, 67], "-274": [0, 0, 0, 0, 0, 68], "-275": [0, 0, 0, 0, 0, 69], "-276": [0, 0, 0, 0, 0, 70], "-277": [0, 0, 0, 0, 0, 71], "-278": [0, 0, 0, 0, 0, 72], "-279": [0, 0, 0, 0, 0, 73], "-280": [0, 0, 0, 0, 0, 74], "-281": [0, 0, 0, 0, 0, 75], "-282": [0, 0, 0, 0, 0, 76], "-283": [0, 0, 0, 0, 0, 77], "-284": [0, 0, 0, 0, 0, 78], "-285": [0, 0, 0, 0, 0, 79], "-286": [0, 0, 0, 0, 0, 80], "-287": [0, 0, 0, 0, 0, 81], "-288": [0, 0, 0, 0, 0, 82], "-289": [0, 0, 0, 0, 0, 83], "-290": [0, 0, 0, 0, 0, 84], "-291": [0, 0, 0, 0, 0, 85], "-292": [0, 0, 0, 0, 0, 86], "-293": [0, 0, 0, 0, 0, 87], "-294": [0, 0, 0, 0, 0, 88], "-295": [0, 0, 0, 0, 0, 89], "-296": [0, 0, 0, 0, 0, 90], "-297": [0, 0, 0, 0, 0, 91], "-298": [0, 0, 0, 0, 0, 92], "-299": [0, 0, 0, 0, 0, 93], "-300": [0, 0, 0, 0, 0, 94], "-301": [0, 0, 0, 0, 0, 95], "-302": [0, 0, 0, 0, 0, 96], "-303": [0, 0, 0, 0, 0, 97], "-304": [0, 0, 0, 0, 0, 98], "-305": [0, 0, 0, 0, 0, 99], "-306": [0, 0, 0, 0, 0, 100], "-307": [0, 0, 0, 0, 0, 101], "-308": [0, 0, 0, 0, 0, 102], "-309": [0, 0, 0, 0, 0, 103], "-310": [0, 0, 0, 0, 0, 104], "-311": [0, 0, 0, 0, 0, 105], "-312": [0, 0, 0, 0, 0, 106], "-313": [0, 0, 0, 0, 0, 107], "-314": [0, 0, 0, 0, 0, 108], "-315": [0, 0, 0, 0, 0, 109], "-316": [0, 0, 0, 0, 0, 110], "-317": [0, 0, 0, 0, 0, 111], "-318": [0, 0, 0, 0, 0, 112], "-319": [0, 0, 0, 0, 0, 113], "-320": [0, 0, 0, 0, 0, 114], "-321": [0, 0, 0, 0, 0, 115], "-322": [0, 0, 0, 0, 0, 116], "-323": [0, 0, 0, 0, 0, 117], "-324": [0, 0, 0, 0, 0, 118], "-325": [0, 0, 0, 0, 0, 119], "-326": [0, 0, 0, 0, 0, 120], "-327": [0, 0, 0, 0, 0, 121], "-328": [0, 0, 0, 0, 0, 122], "-329": [0, 0, 0, 0, 0, 123], "-330": [0, 0, 0, 0, 0, 124], "-331": [0, 0, 0, 0, 0, 125], "-332": [0, 0, 0, 0, 0, 126], "-333": [0, 0, 0, 0, 0, 127]},
  "chord_dict":{
    "A": 0,
    "A#": 1,
    "A#7": 2,
    "A#m": 3,
    "A#maj7": 4,
    "A7": 5,
    "Adim": 6,
    "Am": 7,
    "Am7": 8,
    "Amaj7": 9,
    "Asus4": 10,
    "B": 11,
    "B7": 12,
    "Bdim": 13,
    "Bm7": 14,
    "Bm7b5": 15,
    "C": 16,
    "C#": 17,
    "C#+": 18,
    "C#m": 19,
    "C#maj7": 20,
    "C+": 21,
    "C7": 22,
    "Cm": 23,
    "Cm7": 24,
    "Cmaj7": 25,
    "Csus4": 26,
    "D": 27,
    "D#": 28,
    "D#+": 29,
    "D#dim": 30,
    "D#maj7": 31,
    "D7": 32,
    "Dm": 33,
    "Dm7": 34,
    "Dm7b5": 35,
    "Dmaj7": 36,
    "Dsus4": 37,
    "E": 38,
    "E+": 39,
    "E7": 40,
    "Em": 41,
    "Em7": 42,
    "Emaj7": 43,
    "Esus4": 44,
    "F": 45,
    "F#m7": 46,
    "F#m7b5": 47,
    "F7": 48,
    "Fm": 49,
    "Fm7": 50,
    "Fmaj7": 51,
    "G": 52,
    "G#dim": 53,
    "G#maj7": 54,
    "G+": 55,
    "G7": 56,
    "Gm": 57,
    "Gm7": 58,
    "Gmaj7": 59,
    "Gsus4": 60,
    "s": 61},
  "bar_classes":17,
  "beat_classes":32,
  "if_add_metadata_in_decoder": false,
  "if_add_chord_in_decoder":true,
  "onset_vocab_size": 4099,
  "dur_vocab_size":4099,
  "octave_vocab_size":13,
  "pitch_class_vocab_size":14,
  "instrument_vocab_size":131,
  "velocity_vocab_size":130, 
  "onset_embedding": {"method": "FME", "base":199999},
  "dur_embedding":{"method": "FME", "base":1031},
  "octave_embedding":{"method": "FME", "base":19},
  "pitch_embedding":{"method": "FME", "base":20},
  "instrument_embedding":{"method": "WE", "vocab_size": 131},
  "velocity_embedding":{"method": "FME", "base":131},
  "decode_vocab_size":8487, 
  "decoder":{"hidden_size":1536, "num_hidden_layers":4, "_attn_implementation":"GRU", "rms_norm_eps": 1e-05, "attention_dropout": 0.0, "num_attention_heads":16, "num_key_value_heads": 4, "attention_bias": false, "pretraining_tp": 1, "intermediate_size":1024, "mlp_bias": false, "hidden_act": "silu", "max_position_embeddings":7}
}
