{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "hidden_size": 3072,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 24,
  "num_hidden_layers": 32,
  "num_key_value_heads": 6,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null, 
  "rope_theta": 500000.0,
  "rope_theta_onset":89021, 
  "rope_theta_dur":89022,
  "rope_theta_octave":80922,
  "rope_theta_pitch":89023,
  "rope_theta_velocity":89024,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.41.0.dev0",
  "use_cache": true,
  "onset_vocab_size": 21,
  "dur_vocab_size":1001,
  "octave_vocab_size":9,
  "pitch_class_vocab_size":13,
  "instrument_vocab_size":130,
  "velocity_vocab_size":129, 
  "onset_embedding": {"method": "FME", "base":89021},
  "dur_embedding":{"method": "FME", "base":89022},
  "octave_embedding":{"method": "FME", "base":89023},
  "pitch_embedding":{"method": "FME", "base":89024},
  "instrument_embedding":{"method": "WE", "vocab_size": 129},
  "velocity_embedding":{"method": "FME", "base":89025},
  "output_attention_layer":{"layers":1, "hidden_size":512, "_attn_implementation":"output", "rms_norm_eps": 1e-05, "attention_dropout": 0.0, "num_attention_heads":32, "num_key_value_heads": 8, "attention_bias": false, "pretraining_tp": 1, "intermediate_size":3584, "mlp_bias": false, "hidden_act": "silu"}
}
